```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_s3_bucket.app_bucket will be created
+   resource "aws_s3_bucket" "app_bucket" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "aws-hosted-react"
+       bucket_domain_name          = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = true
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags_all                    = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule {
+           allowed_headers = (known after apply)
+           allowed_methods = (known after apply)
+           allowed_origins = (known after apply)
+           expose_headers  = (known after apply)
+           max_age_seconds = (known after apply)
        }

+       grant {
+           id          = (known after apply)
+           permissions = (known after apply)
+           type        = (known after apply)
+           uri         = (known after apply)
        }

+       lifecycle_rule {
+           abort_incomplete_multipart_upload_days = (known after apply)
+           enabled                                = (known after apply)
+           id                                     = (known after apply)
+           prefix                                 = (known after apply)
+           tags                                   = (known after apply)

+           expiration {
+               date                         = (known after apply)
+               days                         = (known after apply)
+               expired_object_delete_marker = (known after apply)
            }

+           noncurrent_version_expiration {
+               days = (known after apply)
            }

+           noncurrent_version_transition {
+               days          = (known after apply)
+               storage_class = (known after apply)
            }

+           transition {
+               date          = (known after apply)
+               days          = (known after apply)
+               storage_class = (known after apply)
            }
        }

+       logging {
+           target_bucket = (known after apply)
+           target_prefix = (known after apply)
        }

+       object_lock_configuration {
+           object_lock_enabled = (known after apply)

+           rule {
+               default_retention {
+                   days  = (known after apply)
+                   mode  = (known after apply)
+                   years = (known after apply)
                }
            }
        }

+       replication_configuration {
+           role = (known after apply)

+           rules {
+               delete_marker_replication_status = (known after apply)
+               id                               = (known after apply)
+               prefix                           = (known after apply)
+               priority                         = (known after apply)
+               status                           = (known after apply)

+               destination {
+                   account_id         = (known after apply)
+                   bucket             = (known after apply)
+                   replica_kms_key_id = (known after apply)
+                   storage_class      = (known after apply)

+                   access_control_translation {
+                       owner = (known after apply)
                    }

+                   metrics {
+                       minutes = (known after apply)
+                       status  = (known after apply)
                    }

+                   replication_time {
+                       minutes = (known after apply)
+                       status  = (known after apply)
                    }
                }

+               filter {
+                   prefix = (known after apply)
+                   tags   = (known after apply)
                }

+               source_selection_criteria {
+                   sse_kms_encrypted_objects {
+                       enabled = (known after apply)
                    }
                }
            }
        }

+       server_side_encryption_configuration {
+           rule {
+               bucket_key_enabled = (known after apply)

+               apply_server_side_encryption_by_default {
+                   kms_master_key_id = (known after apply)
+                   sse_algorithm     = (known after apply)
                }
            }
        }

+       versioning {
+           enabled    = (known after apply)
+           mfa_delete = (known after apply)
        }

+       website {
+           error_document           = (known after apply)
+           index_document           = (known after apply)
+           redirect_all_requests_to = (known after apply)
+           routing_rules            = (known after apply)
        }
    }

  # aws_s3_bucket_acl.app_bucket_acl will be created
+   resource "aws_s3_bucket_acl" "app_bucket_acl" {
+       acl    = "public-read"
+       bucket = (known after apply)
+       id     = (known after apply)

+       access_control_policy {
+           grant {
+               permission = (known after apply)

+               grantee {
+                   display_name  = (known after apply)
+                   email_address = (known after apply)
+                   id            = (known after apply)
+                   type          = (known after apply)
+                   uri           = (known after apply)
                }
            }

+           owner {
+               display_name = (known after apply)
+               id           = (known after apply)
            }
        }
    }

  # aws_s3_bucket_website_configuration.app_bucket_web_config will be created
+   resource "aws_s3_bucket_website_configuration" "app_bucket_web_config" {
+       bucket           = "aws-hosted-react"
+       id               = (known after apply)
+       routing_rules    = (known after apply)
+       website_domain   = (known after apply)
+       website_endpoint = (known after apply)

+       error_document {
+           key = "index.html"
        }

+       index_document {
+           suffix = "index.html"
        }

+       routing_rule {
+           condition {
+               http_error_code_returned_equals = (known after apply)
+               key_prefix_equals               = (known after apply)
            }

+           redirect {
+               host_name               = (known after apply)
+               http_redirect_code      = (known after apply)
+               protocol                = (known after apply)
+               replace_key_prefix_with = (known after apply)
+               replace_key_with        = (known after apply)
            }
        }
    }

  # aws_s3_object.static_files["asset-manifest.json"] will be created
+   resource "aws_s3_object" "static_files" {
+       acl                    = "public-read"
+       bucket                 = "aws-hosted-react"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "application/json"
+       etag                   = "c1e1dacbe1d9885f87a42834c3bd80d1"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "asset-manifest.json"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "../react-build/asset-manifest.json"
+       storage_class          = (known after apply)
+       tags_all               = (known after apply)
+       version_id             = (known after apply)
    }

  # aws_s3_object.static_files["favicon.ico"] will be created
+   resource "aws_s3_object" "static_files" {
+       acl                    = "public-read"
+       bucket                 = "aws-hosted-react"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "image/vnd.microsoft.icon"
+       etag                   = "c92b85a5b907c70211f4ec25e29a8c4a"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "favicon.ico"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "../react-build/favicon.ico"
+       storage_class          = (known after apply)
+       tags_all               = (known after apply)
+       version_id             = (known after apply)
    }

  # aws_s3_object.static_files["index.html"] will be created
+   resource "aws_s3_object" "static_files" {
+       acl                    = "public-read"
+       bucket                 = "aws-hosted-react"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "text/html; charset=utf-8"
+       etag                   = "6d3304efc593ae25ef1e3473726ede34"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "index.html"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "../react-build/index.html"
+       storage_class          = (known after apply)
+       tags_all               = (known after apply)
+       version_id             = (known after apply)
    }

  # aws_s3_object.static_files["logo192.png"] will be created
+   resource "aws_s3_object" "static_files" {
+       acl                    = "public-read"
+       bucket                 = "aws-hosted-react"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "image/png"
+       etag                   = "33dbdd0177549353eeeb785d02c294af"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "logo192.png"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "../react-build/logo192.png"
+       storage_class          = (known after apply)
+       tags_all               = (known after apply)
+       version_id             = (known after apply)
    }

  # aws_s3_object.static_files["logo512.png"] will be created
+   resource "aws_s3_object" "static_files" {
+       acl                    = "public-read"
+       bucket                 = "aws-hosted-react"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "image/png"
+       etag                   = "917515db74ea8d1aee6a246cfbcc0b45"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "logo512.png"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "../react-build/logo512.png"
+       storage_class          = (known after apply)
+       tags_all               = (known after apply)
+       version_id             = (known after apply)
    }

  # aws_s3_object.static_files["manifest.json"] will be created
+   resource "aws_s3_object" "static_files" {
+       acl                    = "public-read"
+       bucket                 = "aws-hosted-react"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "application/json"
+       etag                   = "d9d975cebe2ec20b6c652e1e4c12ccf0"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "manifest.json"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "../react-build/manifest.json"
+       storage_class          = (known after apply)
+       tags_all               = (known after apply)
+       version_id             = (known after apply)
    }

  # aws_s3_object.static_files["robots.txt"] will be created
+   resource "aws_s3_object" "static_files" {
+       acl                    = "public-read"
+       bucket                 = "aws-hosted-react"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "text/plain; charset=utf-8"
+       etag                   = "fa1ded1ed7c11438a9b0385b1e112850"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "robots.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "../react-build/robots.txt"
+       storage_class          = (known after apply)
+       tags_all               = (known after apply)
+       version_id             = (known after apply)
    }

  # aws_s3_object.static_files["static/css/main.22941023.css"] will be created
+   resource "aws_s3_object" "static_files" {
+       acl                    = "public-read"
+       bucket                 = "aws-hosted-react"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "text/css; charset=utf-8"
+       etag                   = "7e5c16e8be85f95f19fa9f527faf0810"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "static/css/main.22941023.css"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "../react-build/static/css/main.22941023.css"
+       storage_class          = (known after apply)
+       tags_all               = (known after apply)
+       version_id             = (known after apply)
    }

  # aws_s3_object.static_files["static/css/main.22941023.css.map"] will be created
+   resource "aws_s3_object" "static_files" {
+       acl                    = "public-read"
+       bucket                 = "aws-hosted-react"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "application/octet-stream"
+       etag                   = "506c1a1be725c33b46e2b7aef1bb1476"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "static/css/main.22941023.css.map"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "../react-build/static/css/main.22941023.css.map"
+       storage_class          = (known after apply)
+       tags_all               = (known after apply)
+       version_id             = (known after apply)
    }

  # aws_s3_object.static_files["static/js/main.9ba1114e.js"] will be created
+   resource "aws_s3_object" "static_files" {
+       acl                    = "public-read"
+       bucket                 = "aws-hosted-react"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "application/javascript"
+       etag                   = "6a7c37b5e0742252f8e3c744603a03ad"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "static/js/main.9ba1114e.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "../react-build/static/js/main.9ba1114e.js"
+       storage_class          = (known after apply)
+       tags_all               = (known after apply)
+       version_id             = (known after apply)
    }

  # aws_s3_object.static_files["static/js/main.9ba1114e.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "static_files" {
+       acl                    = "public-read"
+       bucket                 = "aws-hosted-react"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "text/plain; charset=utf-8"
+       etag                   = "b114cc85da504a772f040e3f40f8e46a"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "static/js/main.9ba1114e.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "../react-build/static/js/main.9ba1114e.js.LICENSE.txt"
+       storage_class          = (known after apply)
+       tags_all               = (known after apply)
+       version_id             = (known after apply)
    }

  # aws_s3_object.static_files["static/js/main.9ba1114e.js.map"] will be created
+   resource "aws_s3_object" "static_files" {
+       acl                    = "public-read"
+       bucket                 = "aws-hosted-react"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "application/octet-stream"
+       etag                   = "e62e3d844715b3b6d99d9ac3eb2bb091"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "static/js/main.9ba1114e.js.map"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "../react-build/static/js/main.9ba1114e.js.map"
+       storage_class          = (known after apply)
+       tags_all               = (known after apply)
+       version_id             = (known after apply)
    }

Plan: 15 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   website_endpoint = (known after apply)
```